// --створити масив з:
// - з 5 числових значень
// let numbers = [ 1, 5, 8, -3, 10];

// - з 5 стічкових значень
// let str = ['Яна', 'Женя', 'Діма', 'Ігор', 'Аня'];

// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let data = [true, 'Audi', 500, 2015, false];
// console.log(data);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. 
//Вивести в консоль

// let carArray = [];
// carArray[0] = true;
// carArray[1] = 'Volkswagen';
// carArray[2] = 3000;
// carArray[3] = 2019;
// carArray[4] = false;

// console.log(carArray);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
// 	document.write("<div>Текст</div>");
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
// 	document.write(`<div>Текст ${i}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0;
// while (i < 20) {
//   document.write('<h1>Заголовок</h1>');
//   i++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0;
// while (i < 20) {
//   document.write(`<h1>Заголовок ${i}</h1>`);
//   i++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr = [5, 1005, 45, -50, 15, 555555, -543, 95, 500, 5];
// for (let i of arr) {
// 	console.log(i);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let str2 = ['str 1', 'що попало', 'строка3', 'str4', 'якісь дані', 'хочу', 'спати', 'str', 'cnhjrf', 'ten'];
// for (let i of str2) {
// 	console.log(i);
// }
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arr10 = [1, 'true', true, 'element', -100, 'data', false, 'eight', 9, 'ten'];
// for(let i of arr10) {
// 	console.log(i);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. 
//За допомогою if та typeof вивести тільки булеві елементи
// let arr11 = [1, 'true', true, 'element', -100, 'data', false, 'eight', 9, 'ten'];
// for(let i of arr11) {
// 	if (typeof i === "boolean") {
// 	console.log(i);}

// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки числові елементи
// let arr12 = [1, 'true', true, 'element', -100, 'data', false, 'eight', 9, 'ten'];
// for(let i of arr12) {
// 	if (typeof i === "number") {
// 	console.log(i);}

// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. 
//За допомогою if та typeof вивести тільки рядкові елементи

// let arr13 = [1, 'true', true, 'element', -100, 'data', false, 'eight', 9, 'ten'];
// for(let i of arr13) {
// 	if (typeof i === "string") {
// 	console.log(i);}

// }

// - Створити порожній масив. 
//Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. 
//Вивести в консоль всі його елементи в циклі.
// let arr14 = [];
// arr14[0] = 1;
// arr14[1] = true;
// arr14[2] = 'data';
// arr14[3] = 'string';
// arr14[4] = 'true';
// arr14[5] =  100;
// arr14[6] =  false;
// arr14[7] =  -100;
// arr14[8] =  0;
// arr14[9] =  'djghf';
// for (let i of arr14) {
// 	console.log(i);
// }
// - Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
// 	console.log('Крок ' + (i + 1));
// 	document.write('Крок ' + (i + 1) + '<br>');

// }

// - Створити цикл for на 100 ітерацій з кроком 1. 
//Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++) {
// 	console.log('Крок ' + (i + 1));
// 	document.write('Крок ' + (i + 1) + '<br>');

// }

// - Створити цикл for на 100 ітерацій з кроком 2.
// Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i = i + 2) {
// 	console.log('Крок ' + (i + 1));
// 	document.write('Крок ' + (i + 1) + '<br>');

// }

// - Створити цикл for на 100 ітерацій.
// Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
// if (i % 2) {
// 	console.log('Крок ' + (i + 1));
// 	document.write('Крок ' + (i + 1) + '<br>');
// }

// }


// - Створити цикл for на 100 ітерацій.
// Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
// if (!(i % 2)) {
// 	console.log('Крок ' + (i + 1));
// 	document.write('Крок ' + (i + 1) + '<br>');}

// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

//  for (let min = 0; min < 60; min++) {
//          if (min == 2) {
//          break;
//      }
//      for (let sec = 0; sec < 60; sec++) {
//         console.log(`${min}: ${sec}`);
//      }
//  }
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини 
//(3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// for (let h = 0; h < 12; h++) {
//     if (h == 2) {
//         break;
//      }  
//     for (let min = 0; min < 60; min++) {
//             if (min == 20) {
//          break;
//     }
// for (let sec = 0; sec < 60; sec++) {
//    console.log(`${h} : ${min} : ${sec}`);
//         }
//     }
// }

// ______________________________________________________________________________________________________________________________________________________
//                                                                 РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________


// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr15 = ['a', 'b', 'c'];
// let num = [1, 2, 3];

// 	for (let j of num) {
// 		arr15.push(j);
// 	}

// console.log(arr);

// - Дан масив [1, 2, 3].
// Зробіть з нього новий масив [3, 2, 1].
// 	let arr16 = [1, 2, 3];
//  for (let i = 0; i < arr16.length; i++) {
//  	 	arr16[i] = arr16.length - i;
// 	 }
// console.log(arr16);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let arr17 = [1, 2, 3];
// let arr18 = [4, 5, 6];

// let arr19 = arr17.concat(arr18);
// console.log(arr3);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let arr20 = [1, 2, 3];
// arr20.unshift(4, 5, 6);
// console.log(arr20);

// - Дан масив ['js', 'css', 'jq'].
// Виведіть на екран перший елемент за допомогою shift()
// let arr21 = ['js', 'css', 'jq'];
// let a = arr21.shift();
// console.log(a);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr22 = ['js', 'css', 'jq'];
// let b = arr22.pop();
//  console.log(b);

// - Дан масив [1, 2, 3, 4, 5]. 
//За допомогою методу/функції slice перетворіть масив в [4, 5].
// let arr23 = [1, 2, 3, 4, 5];
// let arr24 = arr.slice(3);
// arr23 = arr24;
// console.log(arr23);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

// let arr25 = [1, 2, 3, 4, 5];
// let arr26 = arr.slice(0, 2);
// arr25 = arr26;
// console.log(arr25);

// - Дан масив [1, 2, 3, 4, 5].
// За допомогою методу/функції splice перетворіть масив в [1, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// let arr1 = arr.slice(0, 1);
// let arr2 = arr.slice(3);
// arr = arr1.concat(arr2);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. 
//За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5].
// За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8, 0, 'e');
// console.log(arr);

// - Взяти масив з 10 чисел або створити його. 
//Вивести в консоль тільки ті елементи, значення яких є парними.

// let arr = [100, 200, 305, 401, 500, 600, 700, 800, 900, 10000]
// for (let i = 0; i < arr.length; i++){
// 	 if(arr[i] % 2 === 0) {
// 		console.log(arr[i]);
// 	}
// }


// - Взяти масив з 10 чисел або створити його. 
//Створити 2й порожній масив.
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [100, 200, 305, 401, 500, 600, 700, 800, 900, 10000];
// let emtyArr = [];

// for (let i of arr) {
// 	emtyArr.push(i);
// }

// console.log(emtyArr);

// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let arr =  [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
// let a = 0;
// while (a < arr.length) {
// 	console.log(arr[a]);
//    a++;
// }

// 2. перебрати його циклом for

// for (let i = 0; i < arr.length; i++ ) {
// 	console.log(arr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let a = 0;
// while (a < arr.length) {
	
// 	if(a % 2 !== 0) {
// 		console.log(arr[a]);
// 	}
//    a++;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (let i = 0; i < arr.length; i++) {
// 	if(i % 2 !== 0) {
// 		console.log(arr[i]);
// 	}
// }

// 5. перебрати циклом while та вивести  числа тільки парні значення
// let a = 0;
// while (a < arr.length) {
// 	if(arr[a] % 2 === 0)
// 	console.log(arr[a]);
//    a++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i < arr.length; i++) {
// 	if(arr[i] % 2 === 0) {
// 		console.log(arr[i]);
// 	}
// }

// 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < arr.length; i++) {

// 	if(arr[i] % 3 === 0) {
// 		arr[i] = 'okten';
// 	}
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
// let arr =  [2,17,13,6,22,31,45,66,100,-18];

// arr.reverse();
// console.log(arr);

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// let a = arr.length - 1;
// while (a > 0) {
// 	console.log(arr[a]);
//    a--;
// }

// for (let i = arr.length - 1; i > 0; i-- ) {
// 	console.log(arr[i]);
// }

// let a = arr.length - 1;
// while (a > 0) {
	
// 	if(a % 2 !== 0) {
// 		console.log(arr[a]);
// 	}
//    a--;
// }

// for (let i = arr.length - 1; i > 0; i--) {
// 	if(i % 2 !== 0) {
// 		console.log(arr[i]);
// 	}
// }


// let a = arr.length - 1;
// while (a > 0) {
// 	if(arr[a] % 2 === 0)
// 	console.log(arr[a]);
//    a--;
// }

// for (let i = arr.length; i > 0; i--) {

// 	if(arr[i] % 3 === 0) {
// 		arr[i] = 'okten';
// 	}
// }
// console.log(arr);


// for (let i = arr.length - 1; i > 0; i--) {
// 	if(arr[i] % 2 === 0) {
// 		console.log(arr[i]);
// 	}
// }



// 10

// 1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу.

			// let emtyArr = [];
			// for (let i = 0; i < 50; i = i+2) {
			// 	emtyArr.push(i);
			// }
			// console.log(emtyArr);

//        b. заповнити його 50 непарними числами за допомоги циклу.
			// let emtyArr = [];
			// for (let i = 0; i < 50; i++) {
			// 	if(i % 2 !== 0) {
			// 		emtyArr.push(i);}
			// }
			// console.log(emtyArr);

//        c. используя Math.random заполнить массив из ???(сколько хотите) элементов.

			// let emtyArr = [];
			// for (let i = 0; i < 5; i++) {
			// 		emtyArr.push(Math.round(Math.random()*100));}
			// 	console.log(emtyArr);

//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)

			// let emtyArr = [];
			// for (let i = 0; i < 5; i++) {
			// 		emtyArr.push(Math.round(Math.random()*732) + 8);}
			// 	console.log(emtyArr);

//  2. Вивести за допомогою console.log кожен третій елемен

// let arr =  [2,17,13,6,22,31,45,66,100,-18]; 
// for (let i = 2; i < arr.length; i = i + 3) {
// 			console.log(arr[i]);
// 	}


//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
	// for (let i = 2; i < arr.length; i = i + 3) {
	// 		if( arr[i] % 2 === 0) {
	// 		console.log(arr[i]);}
	// }

//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним
// та записати їх в новий масив
// let emtyArr = [];
// for (let i = 2; i < arr.length; i = i + 3) {
// 			if( arr[i] % 2 === 0) {
// 			emtyArr.push(arr[i]);}
// 	}
// 	console.log(emtyArr);

//  5. Вивести кожен елемент масиву, сусід зпарва якого є парним

//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let arr10 = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ];

// for (let i = 0; i < arr10.length; i++) {
// 	if (arr10[i + 1] % 2 === 0) {
// 		console.log(arr10[i]);
// 	}
// }


//  6. Є масив з числами [100,250,50,168,120,345,188], 
//Які характеризують вартість окремої покупки. Обрахувати середній чек.

// let array = [100,250,50,168,120,345,188];

// let sum = 0; 
// for (let i = 0; i < array.length; i++) {
// 	sum += array[i];
	
// }

// let check = sum / array.length;
// 	console.log(check);


//  7. Створити масив з рандомними значеннями, 
//помножити всі його елементи на 5 та перемістити їх в інший масив.

// let randomArr = [];
// let secondArr = []
// for (let i = 0; i < 5; i++) {
// 	randomArr.push(Math.round(Math.random()*100));
// }
// console.log(randomArr);

// for (let i = 0; i < randomArr.length; i++) {
// 	secondArr.push(randomArr[i]*5)
// 	}
// console.log(secondArr);

//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому,
// і якщо елемент є числом - додати його в інший масив.

// let data2 = [true, 'Audi', 500, 2015, false];
// let dataNew = [];
// for ( let i of  data2) {
// 	if( typeof i === 'number') {
// 		dataNew.push(i);
// 	}
// }
// console.log(dataNew)


// ______________________________________________________________________________________________________________________________________________________
//                                                                     Додатково
// ______________________________________________________________________________________________________________________________________________________

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
let txt = [ 'a', 'b', 'c'];
let word = '';

// for (let i = 0; i < txt.length; i++) {
// 	word += txt[i];
// }
// console.log(word);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// i = 0;
// while (i < txt.length) {
// 	word += txt[i];
// 	i++;
// }
// console.log(word);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
for (let i of txt) {
	word += i;
}
console.log(word);
